---
title: DimensionEqualityLabelFormatting
classe: Autodesk.Revit.DB.DimensionEqualityLabelFormatting
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# DimensionEqualityLabelFormatting

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `dimensionEqualityLabelFormatting.IsValidObject` | Boolean |
| `LabelType LabelType { get; }` | `dimensionEqualityLabelFormatting.LabelType` | LabelType |
| `Int32 LeadingSpaces { get; set; }` | `dimensionEqualityLabelFormatting.LeadingSpaces` | Int32 |
| `String Prefix { get; set; }` | `dimensionEqualityLabelFormatting.Prefix` | String |
| `String Suffix { get; set; }` | `dimensionEqualityLabelFormatting.Suffix` | String |
| `Void Dispose()` | `dimensionEqualityLabelFormatting.Dispose()` | Void |
| `FormatOptions GetFormatOptions()` | `dimensionEqualityLabelFormatting.GetFormatOptions()` | FormatOptions |
| `Boolean IsValidFormatOptions()` | `dimensionEqualityLabelFormatting.IsValidFormatOptions()` | Boolean |
| `Void SetFormatOptions(FormatOptions)` | `dimensionEqualityLabelFormatting.SetFormatOptions(formatOptions)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```